# AddSurface

## Description
Creates a new surface object by combining the two referenced surface objects. If the combination is successful (if the objects overlap), it deletes the original surface objects and returns the handle of the resultant object.&lt;BR&gt;

```pascal
FUNCTION AddSurface(
				s1 : HANDLE;
				s2 : HANDLE) : HANDLE;
```

```python

def vs.AddSurface(s1, s2):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|s1|HANDLE|Handle to object.|
|s2|HANDLE|Handle to object.|

## Returns
Returns a HANDLE to a new surface object.

## Examples
```pascal
PROCEDURE AddSurfaceExample;

VAR

	h1, h2, h3 :HANDLE;

BEGIN

	DSelectAll;

	CallTool(-203);

	h1 := FSActLayer;

	DSelectAll;

	CallTool(-203);

	h2 := FSActLayer;

	h3 := AddSurface(h1, h2);

	IF h3 &lt;&gt; nil THEN SetFPat(h3, 5);

END;

RUN(AddSurfaceExample);
```

## See Also
VS Functions:
ClipSurface

## Version
Availability: from VectorWorks8.5
## Category
* Objects - 2D